---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FailureDefinitionRegistry Properties
FailureDefinitionRegistry Class See Also Send Feedback
---

The FailureDefinitionRegistry type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FailureDefinitionRegistry Class

Autodesk.Revit.DB Namespace